Revit 2027 API
AreaLoad.GetRefPoint Method
 Returns the physical location of the reference point.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetRefPoint(
	int index
)
Public Function GetRefPoint (
	index As Integer
) As XYZ
public:
XYZ^ GetRefPoint(
	int index
)
member GetRefPoint :
        index : int -> XYZ
Parameters
index Int32
 The index of the point to return.
Return Value
XYZ
Exceptions
Exception | Condition
ArgumentException |  Thrown when index is out of range.
Remarks
 The index should be between 0 and less than NumRefPoints.
See Also
Reference
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace